In [41]:
import numpy as np
import pandas as pd
from numpy.random import uniform


df = pd.DataFrame(uniform(0,1,(5,4)),
                  index = 'A B C D E'.split(),
                  columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.837834  0.395231  0.068768  0.941494
B  0.814938  0.356142  0.431580  0.485803
C  0.002938  0.547215  0.387990  0.830590
D  0.642576  0.888448  0.373027  0.904230
E  0.274358  0.142893  0.794647  0.876839

In [2]:
df = pd.DataFrame(uniform(0,1,(5,4)),
                  columns='W X Y Z'.split())
df

          W         X         Y         Z
0  0.492235  0.822151  0.581881  0.353456
1  0.867625  0.400380  0.342382  0.200988
2  0.056638  0.569460  0.003396  0.051488
3  0.778771  0.683219  0.232341  0.188775
4  0.072453  0.522228  0.976417  0.334161

In [3]:
df = pd.DataFrame(uniform(0,1,(5,4)),
                  columns=['A','B','C','D'])
df

          A         B         C         D
0  0.352258  0.934865  0.492457  0.492420
1  0.517537  0.849719  0.242430  0.206686
2  0.945184  0.782608  0.897892  0.715590
3  0.132409  0.362549  0.777915  0.581382
4  0.626251  0.111972  0.703856  0.586389

In [4]:
df['A']

0    0.352258
1    0.517537
2    0.945184
3    0.132409
4    0.626251
Name: A, dtype: float64

In [8]:
print(type(df['A']))
print(type(df))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [11]:
df['AB'] = df['A'] + df['B']
df

          A         B         C         D        AB
0  0.352258  0.934865  0.492457  0.492420  1.287123
1  0.517537  0.849719  0.242430  0.206686  1.367256
2  0.945184  0.782608  0.897892  0.715590  1.727791
3  0.132409  0.362549  0.777915  0.581382  0.494958
4  0.626251  0.111972  0.703856  0.586389  0.738223

In [15]:
df = df.drop('A',axis=1)
df

          B         C         D        AB
0  0.934865  0.492457  0.492420  1.287123
1  0.849719  0.242430  0.206686  1.367256
2  0.782608  0.897892  0.715590  1.727791
3  0.362549  0.777915  0.581382  0.494958
4  0.111972  0.703856  0.586389  0.738223

In [17]:
df = df.drop(0,axis=0)
df

          B         C         D        AB
1  0.849719  0.242430  0.206686  1.367256
2  0.782608  0.897892  0.715590  1.727791
3  0.362549  0.777915  0.581382  0.494958
4  0.111972  0.703856  0.586389  0.738223

In [18]:
df = df.drop(['B','C','D'],axis=1)
df

         AB
1  1.367256
2  1.727791
3  0.494958
4  0.738223

In [28]:
df = pd.DataFrame(uniform(0,1,(5,4)),
                  index='V W X Y Z'.split(),
                  columns=['A','B','C','D'])
df

          A         B         C         D
V  0.362005  0.011962  0.935516  0.788562
W  0.454572  0.966878  0.123149  0.502737
X  0.518801  0.782551  0.182785  0.723553
Y  0.382379  0.376992  0.079399  0.998154
Z  0.457956  0.099365  0.964152  0.163437

In [29]:
df.loc['V']

A    0.362005
B    0.011962
C    0.935516
D    0.788562
Name: V, dtype: float64

In [30]:
df.iloc[0]

A    0.362005
B    0.011962
C    0.935516
D    0.788562
Name: V, dtype: float64

In [32]:
df.loc['V','A']

0.36200496664545734

In [34]:
df.loc[['X','Y'],['A','B']]

          A         B
X  0.518801  0.782551
Y  0.382379  0.376992

In [36]:
df > 0.5

       A      B      C      D
V  False  False   True   True
W  False   True  False   True
X   True   True  False   True
Y  False  False  False   True
Z  False  False   True  False

In [38]:
df[df['A']>df['B']]

          A         B         C         D
V  0.362005  0.011962  0.935516  0.788562
Y  0.382379  0.376992  0.079399  0.998154
Z  0.457956  0.099365  0.964152  0.163437

In [39]:
df

          A         B         C         D
V  0.362005  0.011962  0.935516  0.788562
W  0.454572  0.966878  0.123149  0.502737
X  0.518801  0.782551  0.182785  0.723553
Y  0.382379  0.376992  0.079399  0.998154
Z  0.457956  0.099365  0.964152  0.163437

In [42]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [44]:
print(df['col2'].unique())
df['col2'].nunique()

[444 555 666]

3

In [45]:
df['col2'] = df['col2']*2
df

   col1  col2 col3
0     1   888  abc
1     2  1110  def
2     3  1332  ghi
3     4   888  xyz

In [46]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [48]:
df = df.sort_values(by='col2')
df

   col1  col2 col3
0     1   888  abc
3     4   888  xyz
1     2  1110  def
2     3  1332  ghi

In [49]:
df.isnull()

    col1   col2   col3
0  False  False  False
3  False  False  False
1  False  False  False
2  False  False  False

In [50]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [52]:
df = df.fillna('100')
df

  col1 col2 col3
0    1  100  abc
1    2  555  def
2    3  666  ghi
3  100  444  xyz

In [58]:
df = pd.DataFrame({'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]})
by_comp = df.groupby("Company")
print(df)
print(by_comp.min())
print(by_comp.mean())
print(by_comp.count())

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350
          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124
         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0
         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [59]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0